In [1]:
import pandas as pd #to handle all the dataframe related

In [2]:
import numpy as np #To handle all the numerical operations

In [3]:
cd

/Users/kantha

In [4]:
cd Downloads

/Users/kantha/Downloads

In [5]:
heart = pd.read_csv('clevelanda.csv')

In [6]:
heart.head() #to print first 5 rows

,age,gender,cp,trestbps,chol,fps,restecg,thalach,exang,oldpeak,slope,ca,thal,class
0,63,1,1,145,233,1,2,150,0,2.3,3,0,6,0
1,67,1,4,160,286,0,2,108,1,1.5,2,3,3,2
2,67,1,4,120,229,0,2,129,1,2.6,2,2,7,1
3,37,1,3,130,250,0,0,187,0,3.5,3,0,3,0
4,41,0,2,130,204,0,2,172,0,1.4,1,0,3,0

In [7]:
heart.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
gender      303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fps         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null object
thal        303 non-null object
class       303 non-null int64
dtypes: float64(1), int64(11), object(2)
memory usage: 33.3+ KB

In [8]:
heart.shape

(303, 14)

In [9]:
#Assessing the data
heart.age

0      63
1      67
2      67
3      37
4      41
       ..
298    45
299    68
300    57
301    57
302    38
Name: age, Length: 303, dtype: int64

In [10]:
heart['age']

0      63
1      67
2      67
3      37
4      41
       ..
298    45
299    68
300    57
301    57
302    38
Name: age, Length: 303, dtype: int64

In [11]:
heart['ca'].unique()

array(['0', '3', '2', '1', '?'], dtype=object)

In [12]:
heart['ca'].value_counts()

0    176
1     65
2     38
3     20
?      4
Name: ca, dtype: int64

In [13]:
heart['age'].mean()

54.43894389438944

In [14]:
heart['age'].min()

29

In [15]:
heart['age'].max()

77

In [16]:
heart['age'].describe()

count    303.000000
mean      54.438944
std        9.038662
min       29.000000
25%       48.000000
50%       56.000000
75%       61.000000
max       77.000000
Name: age, dtype: float64

In [17]:
de = {'training':['DA','ML','DL','AI',np.nan], 'hours':[np.nan,np.nan,5,6,np.nan], 'tools':[np.nan,np.nan,np.nan,4,np.nan]}

In [18]:
df = pd.DataFrame(de)

In [19]:
df

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [20]:
df.isnull()

   training  hours  tools
0     False   True   True
1     False   True   True
2     False  False   True
3     False  False  False
4      True   True   True

In [21]:
df.isnull().sum()

training    1
hours       3
tools       4
dtype: int64

In [22]:
df.dropna(axis=0) #Axis=0 indicates row wise operations

  training  hours  tools
3       AI    6.0    4.0

In [23]:
df

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [24]:
df.dropna(axis=1) #1 is column wise operation

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [25]:
df

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [26]:
df.fillna("ritvik")

  training   hours   tools
0       DA  ritvik  ritvik
1       ML  ritvik  ritvik
2       DL       5  ritvik
3       AI       6       4
4   ritvik  ritvik  ritvik

In [27]:
df['training'].fillna('ritvik')

0        DA
1        ML
2        DL
3        AI
4    ritvik
Name: training, dtype: object

In [31]:
df['training'] = df['training'].fillna('ritvik')

In [32]:
df

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4   ritvik    NaN    NaN